cases/2/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
	porewalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

	walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    inlet
    {
        type            fixedValue;
        value           uniform (0.001 0 0);
    }

    outlet
    {
        type            pressureInletOutletVelocity;
	value           uniform (0 0 0);
    }

	
    frontAndBack
    {
        type            empty;
    }

movingWalls_patch0
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
